freebsd/poudriere/src/man/poudriere-status.8
.\" Copyright (c) 2012 Baptiste Daroussin <bapt@FreeBSD.org>
.\" Copyright (c) 2012-2014 Bryan Drewery <bdrewery@FreeBSD.org>
.\" Copyright (c) 2018 SRI International
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd March 8, 2018
.Dt POUDRIERE-STATUS 8
.Os
.Sh NAME
.Nm "poudriere status"
.Nd Show status of current and previous builds.
.Sh SYNOPSIS
.Nm
.Op Ar options
.Sh DESCRIPTION
This command shows status of current and previous builds.
The output is sorted by by SETNAME, PORTSTREE, JAILNAME and then BUILDNAME.
.Sh OPTIONS
.Bl -tag -width "-f conffile"
.It Fl a
Show all builds, not just latest.
This implies
.Fl f .
.It Fl B Ar name
Specifies which buildname to match on.
This supports shell globbing.
Defaults to "latest".
Specifying this implies the
.Fl f
flag.
.It Fl b
Show details about what each builder for the matched builds are doing.
.It Fl c
Show a more compact output and do not include some columns.
.It Fl f
Show finished builds, not just currently running.
This is implied by the
.Fl a ,
.Fl B
and
.Fl r
flags.
.It Fl H
Do not print headers and separate fields by a single tab instead of arbitrary
white space.
.It Fl j Ar name
Specifies the
.Ar name
of the jail to filter by.
.It Fl l
Show logs instead of URL.
.It Fl p Ar tree
This flag specifies which ports
.Ar tree
to filter builds by.
.It Fl r
Show build results.
This implies the
.Fl f
flag.
.It Fl z Ar set
This specifies which SET to filter builds by.
Use
.Sy 0
to match on empty SET.
.El
.Sh SEE ALSO
.Xr poudriere 8 ,
.Xr poudriere-bulk 8 ,
.Xr poudriere-distclean 8 ,
.Xr poudriere-image 8 ,
.Xr poudriere-jail 8 ,
.Xr poudriere-logclean 8 ,
.Xr poudriere-options 8 ,
.Xr poudriere-pkgclean 8 ,
.Xr poudriere-ports 8 ,
.Xr poudriere-queue 8 ,
.Xr poudriere-testport 8 ,
.Xr poudriere-version 8
.Sh AUTHORS
.An Baptiste Daroussin Aq bapt@FreeBSD.org
.An Bryan Drewery Aq bdrewery@FreeBSD.org
