freebsd/poudriere/src/bin/poudriere-image.8
.\" Copyright (c) 2012 Baptiste Daroussin <bapt@FreeBSD.org>
.\" Copyright (c) 2012-2014 Bryan Drewery <bdrewery@FreeBSD.org>
.\" Copyright (c) 2018 SRI International
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd March 8, 2018
.Dt POUDRIERE-IMAGE 8
.Os
.Sh NAME
.Nm poudriere-image
.Nd build OS filesystem images
.Sh SYNOPSIS
.Nm poudriere
.Op Ar poudriere-options
.Cm image
.Op Ar options
.Sh DESCRIPTION
Builds a filesystem image per the specified options.
.Pp
WARNING: This feature is still considered ALPHA.
.Sh OPTIONS
.Bl -tag -width "-f packagelist"
.It Fl c Ar overlaydir
This specifies an extra directory whose contents will be copied directly into
the final image, starting from the root.
.It Fl f Ar packagelist
This specifies a list of packages to be pre-installed in the final image.
.It Fl h Ar hostname
This specifies the hostname used for the image.
Defaults to
.Ar poudriere-image .
.It Fl j Ar name
This argument specifies the name of the jail that is used.
.It Fl m Ar overlaydir
Build a miniroot image as well (for tar type images), and copy this directory
into the miniroot image.
.It Fl n Ar name
This specifies the name of the resulting image.
.It Fl o Ar outputdir
This argument specifies directory where the resulting image will be created.
.It Fl p Ar tree
This argument specifies the name of the ports tree that is used.
.It Fl s Ar size
This specifies the maximum size of the image that is built.
.It Fl t Ar type
This specifies the type of image to create:
.Bl -tag -width "rawfirmware"
.It iso
An ISO 9660 format image.
.It iso+mfs
An ISO 9660 format image where the root filesystem is MFS mounted.
.It iso+zmfs
An ISO 9660 format image where the root filesystem is LZ77 compressed and is MFS
mounted.
.It usb
A GPT-layout prepared UFS2 image containing a UEFI boot loader.
.It usb+mfs
A GPT-layout prepared UFS2 image containing a UEFI boot loader where the root
filesystem is MFS mounted.
.It usb+zmfs
A GPT-layout prepared UFS2 image containing a UEFI boot loader where the root
filesystem is LZ77 compressed and is MFS mounted.
.It rawdisk
A raw UFS2, softupdates-enabled, disk image.
.It zrawdisk
A raw ZFS disk image.
.It tar
An XZ-compressed tarball.
.It firmware
A NanoBSD style image with a GPT partitions and a UEFI boot loader.
.It rawfirmware
A raw disk image.
.It embedded
Create a u-boot ready embedded image.
.El
.It Fl X Ar excludefile
This specifies a list of files to exclude from the final image.
.It Fl z Ar set
This specifies which SET to use for the build.
.El
.Sh SEE ALSO
.Xr poudriere 8 ,
.Xr poudriere-bulk 8 ,
.Xr poudriere-distclean 8 ,
.Xr poudriere-jail 8 ,
.Xr poudriere-logclean 8 ,
.Xr poudriere-options 8 ,
.Xr poudriere-pkgclean 8 ,
.Xr poudriere-ports 8 ,
.Xr poudriere-queue 8 ,
.Xr poudriere-status 8 ,
.Xr poudriere-testport 8 ,
.Xr poudriere-version 8
.Sh AUTHORS
.An Baptiste Daroussin Aq bapt@FreeBSD.org
.An Bryan Drewery Aq bdrewery@FreeBSD.org
