freebsd/poudriere/src/bin/poudriere-jail.8
.\" Copyright (c) 2012 Baptiste Daroussin <bapt@FreeBSD.org>
.\" Copyright (c) 2012-2014 Bryan Drewery <bdrewery@FreeBSD.org>
.\" Copyright (c) 2018 SRI International
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd March 6, 2019
.Dt POUDRIERE-JAIL 8
.Os
.Sh NAME
.Nm poudriere-jail
.Nd manage jails used to build ports
.Sh SYNOPSIS
.Nm poudriere
.Op Ar poudriere-options
.Cm jail
.Ar subcommand
.Op Ar options
.Sh DESCRIPTION
This command manages the
.Nm
jails which are used as different building environments.
.Pp
One
.Ar subcommand
must be supplied.
.Sh SUBCOMMANDS
.Bl -tag -width "-r name"
.It Fl c
Create a jail.
See
.Sx CAVEATS
for restrictions on the names of jails.
.It Fl d
Delete a jail.
.Pp
If the stdin is a TTY then the command is going to ask for confirmation,
which defaults to
.Dq Ic N
.Pq for no .
Othwerwise, the specified jail is deleted without confirmation.
.It Fl i
Show information about a jail.
See also
.Xr poudriere-status 8 .
.It Fl k
Kill a jail (stop it).
.It Fl l
List all poudriere jails.
.It Fl n
When combined with
.Fl l ,
only display jail name.
.It Fl r Ar name
Rename a jail to
.Ar name .
.It Fl s
Start a jail.
.It Fl u
Update a jail.
.El
.Sh OPTIONS
Except for
.Fl l ,
all of the subcommands require the
.Fl j
option (see below).
.Bl -tag -width "-f conffile"
.It Fl a Ar architecture
Specify the
.Ar architecture
to use in the jail
.Pq for example Cm amd64 .
The default is the architecture of the host.
.It Fl b
Build the source provided with the
.Fl m Cm src= Ns Ar path
option.
.It Fl J Ar number
Run
.Ar number
of
.Xr make 1
jobs in parallel for buildworld.
Defaults to the number of CPUs reported by:
.Dq Li sysctl hw.ncpu .
.It Fl j Ar name
Specify the
.Ar name
of the jail.
.It Fl q
Remove the header when
.Fl l
is the specified mandatory option.
Otherwise, it has no effect.
.It Fl v Ar version
Specify the
.Ar version
of
.Fx
to use in the jail.
If you are using
.Fl m Cm ftp
then the
.Ar version
should in the form of
.Dq Cm 9.0-RELEASE .
If you are using
.Fl m Cm svn
then the
.Ar version
should be in the form of Git or SVN branches, which is usually
in the form of
.Dq Cm stable/9
or
just
.Dq Cm head
for CURRENT.
Other methods only use the
.Ar version
value for display.
.It Fl m Ar method
Specify which
.Ar method
to use to create the jail.
The default is
.Cm http .
.Pp
Pre-built distribution options:
.Bl -tag -width "ftp-archive"
.It Cm allbsd
Fetch from
.Lk http://www.allbsd.org .
.It Cm ftp
Fetch from the host specified to the
.Va FREEBSD_HOST
variable from
.Pa poudriere.conf .
.It Cm ftp-archive
Fetch from
.Lk http://ftp-archive.freebsd.org .
.It Cm http
Same as
.Cm ftp .
.It Cm null
This option can be used to import an existing directory that already contains
an installed system.
The path must be specified with
.Fl M Ar path .
It is expected that this directory be installed to with the following:
.Bd -literal -offset 2n
.Ic # cd /usr/src
.Ic # Ic make installworld DESTDIR= Ns Ar PATH Ic DB_FROM_SRC=1
.Ic # make distrib-dirs DESTDIR= Ns Ar PATH Ic DB_FROM_SRC=1
.Ic # make distribution DESTDIR= Ns Ar PATH Ic DB_FROM_SRC=1
.Ed
.Pp
It will not be copied at the time of running
.Dq Li poudriere jail .
Deleting the jail will attempt to revert any files changed by poudriere.
.It Cm src= Ns Ar path
Install from the given directory at
.Ar path .
This directory will not be built from.
It is expected that it is already built and maps to a corresponding
.Pa /usr/obj
directory.
.It Cm tar= Ns Ar path
Install from the tarball located at the given
.Ar path .
.Pp
Note that if you plan to build any port containing kernel modules then the
specified tarball has to contain the
.Pa /usr/src
files as well.
.It Cm url= Ns Ar path
Fetch from the given
.Ar path .
Any URL supported by
.Xr fetch 1
can be used.
For example:
.Dq Cm url=file:///mirror/10.0 .
.El
.Pp
Build from source options:
.Bl -tag -width "ftp-archiveXX"
.It Cm git Ns Op Cm + Ns Ar protocol
Use Git to download the sources.
.Pp
Use the
.Fl v
flag to set the branch name.
The Git server address is derived from the
.Va GIT_BASEURL
variable in
.Pa poudriere.conf .
.Pp
The following protocols are supported:
.Cm git No (default) , Cm http , https , No and Cm ssh .
.It Sy src= Ns Ar path
Copy the source tree from
.Ar path
into the jail,
and build it.
This option is meant to be used with the
.Fl b
flag.
.It Cm svn Ns Op Cm + Ns Ar protocol
Will use SVN and the
.Sy SVN_HOST
variable in
.Pa poudriere.conf .
Use SVN to download the sources.
.Pp
The SVN host address is derived from the
.Va SVN_HOST
variable in
.Pa poudriere.conf .
.Pp
The following protocols are supported:
.Cm svn No (default) , Cm file , http , No and Cm https .
.El
.It Fl f Ar filesystem
Specifies the
.Ar filesystem
name (${ZPOOL}/jails/filesystem).
.It Fl K Ar kernelname
Install the jail with a kernel.
If the
.Ar kernelname
is an empty string GENERIC will be used.
If installing from ftp then the default kernel will be installed what ever the
.Ar kernelname
value is.
.It Fl M Ar mountpoint
Gives an alternative
.Ar mountpoint
when creating jail.
.It Fl p Ar name
This specifies which port tree to start/stop the jail with.
.It Fl P Ar patch
Apply the specified
.Ar patch
to the source tree before building the jail.
.It Fl S Ar srcpath
Use the specified
.Ar srcpath
as the
.Fx
source tree mounted inside the jail
or from the host for
.Fl m Ar null .
.It Fl t Ar version
instead of upgrading to the latest security fix of the jail version, you can
jump to the new specified
.Ar version .
.It Fl z Ar set
This specifies which SET to start/stop the jail with.
.It Fl x
Build the native-xtools target using the host's
.Pa /usr/src
tree and copy this
into the jail.
The use of
.Pa /usr/src
is due to a bug in the native-xtools build which does not allow it to be
built from the jail's own source.
Used exclusively
for cross building a ports set, typically via qemu-user tools.
.It Fl C Ar data
Clean poudriere
.Ar data
folders when deleting a jail.
Only used for
.Sy -d
option.
.Pp
The
.Pa data
parameter can be one of the following:
.Bl -tag -width "packagesXX"
.It Sy all
.It Sy cache
.It Sy logs
.It Sy packages
.It Sy wkrdirs
.El
.It Fl D
When creating the jail from a git checkout, clone it with the full history
instead of a --depth=1.
.El
.Sh ENVIRONMENT
The
.Nm jail
subcommand may use the following environment variables:
.Bl -tag -width "HTTP_PROXY FTP_PROXY"
.It Sy FETCH_BIND_ADDRESS
The bind address used by
.Xr fetch 1 .
See
.Xr fetch 3
for more details.
.It Sy HTTP_PROXY HTTP_* http_* FTP_PROXY FTP_* http_* SSL_* NO_PROXY no_proxy
The proxy configuration for
.Xr fetch 1 .
See
.Xr fetch 3
for other supported proxy environment variables.
.It Sy MAKEOBJDIRPREFIX
.El
.Sh SEE ALSO
.Xr jail 8 ,
.Xr poudriere 8 ,
.Xr poudriere-bulk 8 ,
.Xr poudriere-distclean 8 ,
.Xr poudriere-image 8 ,
.Xr poudriere-logclean 8 ,
.Xr poudriere-options 8 ,
.Xr poudriere-pkgclean 8 ,
.Xr poudriere-ports 8 ,
.Xr poudriere-queue 8 ,
.Xr poudriere-status 8 ,
.Xr poudriere-testport 8 ,
.Xr poudriere-version 8
.Sh AUTHORS
.An Baptiste Daroussin Aq bapt@FreeBSD.org
.An Bryan Drewery Aq bdrewery@FreeBSD.org
.Sh CAVEATS
.Ss Jailname
.Fl j ,
.Fl z
and
.Fl p
are all used in the name of the jail.
.Pp
Be careful to respect the names supported by jail(8):
.Bd -literal
    "This is an arbitrary string that identifies a jail (except it
     may not contain a '.')"
.Ed
