freebsd/poudriere/src/bin/poudriere.8
.\" Copyright (c) 2012 Baptiste Daroussin <bapt@FreeBSD.org>
.\" Copyright (c) 2012-2014 Bryan Drewery <bdrewery@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd December 13, 2017
.Dt POUDRIERE 8
.Os
.Sh NAME
.Nm poudriere
.Nd bulk package builder and port tester
.Sh SYNOPSIS
.Nm
.Cm command
.Cm subcommand
.Op Ar options
.Sh DESCRIPTION
The
.Nm
tool is used to build packages from the ports tree.
It can also be used to test a single port.
.Sh GLOBAL OPTIONS
.Nm
accepts a global option:
.Bl -tag -width "-f conffile"
.It Fl e Ar etcdir
Path to the directory where
.Nm
will find its configuration data.
See
.Sx FILES
and
.Sx ENVIRONMENT
for more information.
.It Fl A
Force color support, even if not in a TTY.
.It Fl N
Disable color support.
.It Fl v
This will show more information during the build.
Specify twice to enable debug output.
.El
.Sh COMMANDS
The first argument to
.Nm
must be a
.Cm command
from the following list:
.Bl -tag -width "-f conffile"
.It bulk
This command makes a ready-to-export package tree, and fills it with
binary packages built from a given list of ports.
During the build, hit ^T to send
.Dv SIGINFO
and show stats and progress about the build.
.It image
This command creates images.
.It jail
This command manages the
.Nm
jails which are used as different building environments.
.It ports
This command provides management of different portstrees which will be used
by
.Nm .
.It testport
This command, mainly targeted at ports developers, launches a
test on a given port (useful before submitting/committing a port).
.It options
This command allows to configure the options for a given port
.It logclean
This command will cleanup old logfiles
.It distclean
This command will cleanup old distfiles
.It pkgclean
This command will cleanup old and unwanted packages
.It queue
This command allows a non-root user to queue
.Nm
commands.
It is currently
.Sy EXPERIMENTAL .
Using it requires starting
.Sy poudriered
via the provided rc script.
.It status
This command shows status of current and previous builds
.It version
Show version of
.Nm .
.El
.Sh SUBCOMMANDS
Here are the list of subcommands and associated options supported by
.Nm ,
sorted by
.Cm command
order.
.Ss bulk
These subcommands are mutually exclusive.
.Bl -tag -width "-f conffile"
.It Fl a
Build all ports in the tree.
.It Fl f Ar file
Absolute path to a file which contains the list of ports to build.
Ports must be specified in the form
.Ar category/port
and shell-style comments are allowed.
Multiple
.Fl f Ar file
arguments may be specified at once.
.It cat/port cat/port2 ...
A list of ports can be specified directly.
.El
.Pp
See
.Sx FLAVORS
for supported FLAVORS syntax.
.Pp
See
.Sx CUSTOMISATION
to know how to build binary packages with options that differs from
defaults.
.Pp
Here are the options associated with the
.Cm bulk
command.
.Bl -tag -width "-f conffile"
.It Fl B Ar name
Specify which buildname to use.
By default
.Ar YYYY-MM-DD_HH:MM:SS
will be used.
This can be used to resume a previous build and use the same log and URL paths.
Resuming a build will not retry built/failed/skipped/ignored packages.
.It Fl c
Clean
.Em all
previously built packages and logs.
.It Fl C
Clean only the packages specified on the command line or in in the file given in
.Fl f Ar file .
Implies
.Fl c
for
.Fl a .
.It Fl F
Only fetch from original MASTER_SITES.
Skip
.Fx
mirrors.
.It Fl j Ar name
Run the bulk build on the jail named
.Ar name .
.It Fl J Ar number[:number]
This argument specifies how many
.Ar number
jobs will run in parallel for a bulk build.
The optional second
.Ar number
is the number of jobs used for the steps before the build, they are more IO
bound than CPU bound, so you may want to use a different number.
The default pre-build value is 1.25 times the value of the build value.
.It Fl i
Interactive mode.
Enter jail for interactive testing and automatically cleanup when done.
A local
.Xr pkg.conf 5
repository configuration will be installed to
.Pa LOCALBASE/etc/pkg/repos/local.conf
so that
.Xr pkg 8
can be used with any existing packages built for the jail.
The
.Fx
repository will be disabled by default.
.It Fl I
Advanced Interactive mode.
Leaves jail running with ports installed after test.
When done with the jail you will need to manually shut it down:
.Dl "poudriere jail -k -j JAILNAME" .
As with
.Fl i
this will install a
.Xr pkg.conf 5
file for
.Xr pkg 8
usage.
.It Fl n
Dry run.
Show what would be done, but do not actually build or delete any
packages.
.It Fl N
Do not build package repository or INDEX when build is completed.
.It Fl p Ar tree
This flag specifies on which ports
.Ar tree
the bulk build will be done.
.It Fl R
Clean RESTRICTED packages after building.
.It Fl S
Don't recursively rebuild packages affected by other packages requiring
incremental rebuild.
This may result in broken packages if the ones they depend on are updated,
are not ABI-compatible, and were not properly
.Sy PORTREVISION
bumped.
.It Fl t
Add some testing to the specified ports.
Add
.Fl r
to recursively test all port dependencies as well.
Currently uninstalls the port, and disable parallel
jobs for make.
When used with
.Fl a
then
.Fl rk
are implied.
.It Fl r
Recursively test all dependencies as well.
This flag is automatically set when using
.Fl at .
.It Fl k
When using
.Fl t
do not consider failures as fatal.
Do not skip dependent ports on findings.
This flag is automatically set when using
.Fl at .
.It Fl T
Try building BROKEN ports by defining TRYBROKEN for the build.
.It Fl w
Save WRKDIR on build failure.
The WRKDIR will be tarred up into
.Sy ${POUDRIERE_DATA}/wrkdirs .
.It Fl v
This will show more information during the build.
Specify twice to enable debug output.
.It Fl z Ar set
This specifies which SET to use for the build.
See
.Sx CUSTOMISATION
for examples of how this is used.
.El
.Ss image
WARNING: This feature is still considered ALPHA.
.Bl -tag -width "-f packagelist"
.It Fl c Ar overlaydir
This specifies an extra directory whose contents will be copied directly into
the final image, starting from the root.
.It Fl f Ar packagelist
This specifies a list of packages to be pre-installed in the final image.
.It Fl h Ar hostname
This specifies the hostname used for the image.
Defaults to
.Ar poudriere-image .
.It Fl j Ar name
This argument specifies the name of the jail that is used.
.It Fl m Ar overlaydir
Build a miniroot image as well (for tar type images), and copy this directory
into the miniroot image.
.It Fl n Ar name
This specifies the name of the resulting image.
.It Fl o Ar outputdir
This argument specifies directory where the resulting image will be created.
.It Fl p Ar tree
This argument specifies the name of the ports tree that is used.
.It Fl s Ar size
This specifies the maximum size of the image that is built.
.It Fl t Ar type
This specifies the type of image to create:
.Bl -tag -width "rawfirmware"
.It iso
An ISO 9660 format image.
.It iso+mfs
An ISO 9660 format image where the root filesystem is MFS mounted.
.It iso+zmfs
An ISO 9660 format image where the root filesystem is LZ77 compressed and is MFS
mounted.
.It usb
A GPT-layout prepared UFS2 image containing a UEFI boot loader.
.It usb+mfs
A GPT-layout prepared UFS2 image containing a UEFI boot loader where the root
filesystem is MFS mounted.
.It usb+zmfs
A GPT-layout prepared UFS2 image containing a UEFI boot loader where the root
filesystem is LZ77 compressed and is MFS mounted.
.It rawdisk
A raw UFS2, softupdates-enabled, disk image.
.It zrawdisk
A raw ZFS disk image.
.It tar
An XZ-compressed tarball.
.It firmware
A nanobsd style image with a GPT partitions and a UEFI boot loader.
.It rawfirmware
A raw disk image.
.It embedded
Create a u-boot ready embedded image.
.El
.It Fl X Ar excludefile
This specifies a list of files to exclude from the final image.
.It Fl z Ar set
This specifies which SET to use for the build.
.El
.Ss jail
These subcommands are mutually exclusive.
.Bl -tag -width "-f conffile"
.It Fl c
Creates a jail.
.It Fl d
Deletes a jail.
.It Fl i
Show information about a jail.
See also
.Cm status .
.It Fl l
List all poudriere jails.
.It Fl n
When combined with
.Fl l ,
only display jail name.
.It Fl s
Starts a jail.
.It Fl k
Kills a jail (stops it).
.It Fl r Ar name
Rename a jail to
.Ar name .
.It Fl u
Update a jail.
.El
.Pp
Except for
.Fl l ,
all of the subcommands require the
.Fl j
option (see below).
.Pp
Here are the options associated with the
.Cm jail
command.
.Bl -tag -width "-f conffile"
.It Fl b
Build the source provided with the -m src=PATH option.
.It Fl J Ar number
The
.Ar number
of make jobs will run in parallel for buildworld.
Defaults to the number of CPUs reported by:  sysctl hw.ncpu.
.It Fl q
Remove the header when
.Fl l
is the specified mandatory option.
Otherwise, it has no effect.
.It Fl j Ar name
Specifies the
.Ar name
of the jail.
.It Fl v Ar version
Specifies which
.Ar version
of
.Fx
to use in the jail.
If you are using method ftp then the
.Ar version
should in the form of: 9.0-RELEASE.
If you are using method of svn then the
.Ar version
should be in the form of git or svn branches: stable/9 or head for CURRENT.
Other methods only use the value for display.
.It Fl a Ar architecture
Specifies which
.Ar architecture
of
.Fx
to use in the jail.
(Default: same as host)
.It Fl m Ar method
Specifies which
.Ar method
to use to create the jail.
(default:
.Sy http )
.Pp
Pre-built distribution options:
.Bl -tag -width "ftp-archiveXX"
.It Sy allbsd
Use
.Lk http://www.allbsd.org.
.It Sy ftp Sy http
Fetch from configured
.Sy FREEBSD_HOST
variable from
.Pa poudriere.conf .
.It Sy ftp-archive
Fetch from
.Lk http://ftp-archive.freebsd.org.
.It Sy null
This option can be used to import an existing directory that already contains an installed system.
The path must be specified with
.Fl M Ar path .
It is expected that this directory be installed to with the following:
.Bd -literal -offset indent
/usr/src# make installworld DESTDIR=PATH DB_FROM_SRC=1
/usr/src# make distrib-dirs DESTDIR=PATH DB_FROM_SRC=1
/usr/src# make distribution DESTDIR=PATH DB_FROM_SRC=1
.Ed
.Pp
The path will be null-mounted during builds.
It will not be copied at the time of running
.Nm jail .
Deleting the jail will attempt to revert any files changed by poudriere.
.It Sy src=PATH
Install from the given src directory at
.Sy PATH .
This directory will not be built from.
It is expected that it is already built and maps to a corresponding
.Pa /usr/obj
directory.
.It Sy tar=PATH
Install from the tarball at the given
.Sy PATH .
Note that this method requires the tarball contains the
.Pa /usr/src
files as well if you plan to build any port containing modules.
.It Sy url=PATH
Fetch from given
.Sy PATH .
Any URL supported by
.Xr fetch 1
can be used.
For example:
.Dl "url=file:///mirror/10.0"
.El
.Pp
Build from source options:
.Bl -tag -width "ftp-archiveXX"
.It Sy git Sy git+http Sy git+https Sy git+ssh
Will use git, the -v flag to set the branch name and the
.Sy GIT_BASEURL
variable in
.Pa poudriere.conf .
.It Sy src=PATH
With the
.Fl b
flag, the src tree will be copied into the jail and built.
.It Sy svn Sy svn+file Sy svn+http Sy svn+https
Will use SVN and the
.Sy SVN_HOST
variable in
.Pa poudriere.conf .
.El
.It Fl f Ar filesystem
Specifies the
.Ar filesystem
name (${ZPOOL}/jails/filesystem).
.It Fl K Ar kernelname
Install the jail with a kernel.
If the
.Ar kernelname
is an empty string GENERIC will be used.
If installing from ftp then the default kernel will be installed what ever the
.Ar kernelname
value is.
.It Fl M Ar mountpoint
Gives an alternative
.Ar mountpoint
when creating jail.
.It Fl p Ar name
This specifies which port tree to start/stop the jail with.
.It Fl P Ar patch
Apply the specified
.Ar patch
to the source tree before building the jail.
.It Fl S Ar srcpath
Use the specified
.Ar srcpath
as the
.Fx
source tree mounted inside the jail
or from the host for
.Fl m Ar null .
.It Fl t Ar version
instead of upgrading to the latest security fix of the jail version, you can
jump to the new specified
.Ar version .
.It Fl z Ar set
This specifies which SET to start/stop the jail with.
.It Fl x
Build the native-xtools target using the host's
.Pa /usr/src
tree and copy this
into the jail.
The use of
.Pa /usr/src
is due to a bug in the native-xtools build which does not allow it to be
built from the jail's own source.
Used exclusively
for cross building a ports set, typically via qemu-user tools.
.It Fl C Ar data
Clean poudriere
.Ar data
folders when deleting a jail. Only used for
.Sy -d
option.
.Pp
.Bl -tag -width "packagesXX"
.Pa data
options are the following:
.It Sy all
.It Sy cache
.It Sy logs
.It Sy packages
.It Sy wkrdirs
.El
.It Fl D
When creating the jail from a git checkout, clone it with the full history
instead of a --depth=1.
.El
.Ss ports
These subcommands are mutually exclusive.
.Bl -tag -width "-f conffile"
.It Fl c
Creates a ports tree.
.It Fl d
Deletes a ports tree.
.It Fl l
List all available ports trees.
.It Fl u
Update a ports tree.
.El
.Pp
Except for
.Fl l ,
all of the subcommands require the
.Fl p
switch (see below).
.Pp
Here are the options associated with the
.Cm ports
command.
.Bl -tag -width "-f conffile"
.It Fl B Ar branch
Specifies which
.Ar branch
to checkout when using the
.Sy svn
or
.Sy git
methods.
(Default: head/master)
.It Fl F
When used with
.Fl c ,
only create the needed file systems (for ZFS) and directories, but do
not populate them.
.It Fl M Ar mountpoint
Path to the source of a ports tree.
.It Fl f Ar filesystem
The name of the
.Ar filesystem
to create for the ports tree.
If 'none' then do not create a filesystem.
Defaults to poudriere/ports/default.
.It Fl k
When used with
.Fl d ,
only unregister the ports tree without removing the files.
.It Fl m Ar method
When used with
.Fl c ,
specify which
.Ar method
to use to create the ports tree.
Could be portsnap, git, null, svn{,+http,+https,+file,+ssh}.
The default is portsnap.
.Bl -tag -width "svn+https"
.It Sy null
This option can be used to import an existing directory that already contains
a manually managed ports tree.
The path must be specified with
.Fl M Ar path .
The path will be null-mounted during builds.
.El
.It Fl n
When combined with
.Fl l ,
only display the name of the ports tree.
.It Fl p Ar name
Specifies the
.Ar name
of the ports tree to use.
.It Fl q
When used with
.Fl l ,
remove the header in the list view.
.It Fl v
Show more verbose output.
.El
.Ss testport
The specified port will be tested for build and packaging problems.
All missing dependencies will first be built in parallel.
.Ev TRYBROKEN=yes
is automatically defined in the environment to test ports marked as
.Ev BROKEN .
.Bl -tag -width "-f conffile"
.It Oo Fl o Oc Ar origin
Specifies an origin in the ports tree.
See
.Sx FLAVORS
for supported FLAVORS syntax.
.El
.Pp
Here are the options associated with the
.Cm testport
command.
.Bl -tag -width "-f conffile"
.It Fl B Ar name
Specify which buildname to use.
By default
.Ar YYYY-MM-DD_HH:MM:SS
will be used.
This can be used to resume a previous build and use the same log and URL paths.
Resuming a build will not retry built/failed/skipped/ignored packages.
.It Fl c
Run make config for the given port.
.It Fl i
Interactive mode.
Enter jail for interactive testing and automatically cleanup when done.
A local
.Xr pkg.conf 5
repository configuration will be installed to
.Pa LOCALBASE/etc/pkg/repos/local.conf
so that
.Xr pkg 8
can be used with any existing packages built for the jail.
The
.Fx
repository will be disabled by default.
.It Fl I
Advanced Interactive mode.
Leaves jail running with port installed after test.
When done with the jail you will need to manually shut it down:
.Dl "poudriere jail -k -j JAILNAME" .
As with
.Fl i
this will install a
.Xr pkg.conf 5
file for
.Xr pkg 8
usage.
.It Fl j Ar name
Runs only inside the jail named
.Ar name .
.It Fl J Ar number[:number]
This argument specifies how many
.Ar number
jobs will run in parallel for building the dependencies.
The optional second
.Ar number
is the number of jobs used for the steps before the build, they are more IO
bound than CPU bound, so you may want to use a different number.
The default pre-build value is 1.25 times the value of the build value.
.It Fl k
Do not consider failures as fatal.
Find all failures.
.It Fl n
Dry run.
Show what would be done, but do not actually build or delete any
packages.
.It Fl N
Do not build package repository or INDEX when build of dependencies is completed.
.It Fl P
Use custom prefix.
.It Fl p Ar tree
Specifies which ports
.Ar tree
to use.
.It Fl S
Don't recursively rebuild packages affected by other packages requiring
incremental rebuild.
This may result in broken packages if the ones they depend on are updated,
are not ABI-compatible, and were not properly
.Sy PORTREVISION
bumped.
.It Fl v
This will show more information during the build.
Specify twice to enable debug output.
.It Fl w
Save WRKDIR on build failure.
The WRKDIR will be tarred up into
.Sy ${POUDRIERE_DATA}/wrkdirs .
.It Fl z Ar set
This specifies which SET to use for the build.
See
.Sx CUSTOMISATION
for examples of how this is used.
.El
.Ss logclean
.Bl -tag -width "-f conffile"
.It Fl a
Remove all logfiles matching the filter.
.It Ar days
How many days old of logfiles to keep matching the filter.
.It Fl N Ar count
How many logfiles to keep matching the filter per
jail/tree/set combination.
.El
.Pp
This command accepts the following options:
.Bl -tag -width "-f conffile"
.It Fl j Ar name
Specifies the
.Ar name
of the jail to filter by.
.It Fl n
Dry run, do not actually delete anything.
.It Fl B Ar name
Specifies which buildname to match on.
May be a glob.
.It Fl p Ar tree
Specifies which ports
.Ar tree
to use.
This can be specified multiple times to consider multiple trees.
.It Fl y
Assume yes, do not confirm and just delete the files.
.It Fl v
This will show more information during the build.
Specify twice to enable debug output.
.It Fl z Ar set
This specifies which SET to filter builds by.
Use
.Sy 0
to match on empty SET.
.El
.Ss distclean
These subcommands are mutually exclusive.
.Bl -tag -width "-f conffile"
.It Fl a
Clean all ports in the tree.
.It Fl f Ar file
Absolute path to a file which contains the list of ports to clean.
Ports must be specified in the form
.Ar category/port
and shell-style comments are allowed.
Multiple
.Fl f Ar file
arguments may be specified at once.
.It cat/port cat/port2 ...
A list of ports can be specified on the command line.
.El
.Pp
Here are the options associated with the
.Cm distclean
command.
.Bl -tag -width "-f conffile"
.It Fl J Ar number
This argument specifies how many
.Ar number
jobs will run in parallel for gathering distfile information.
.It Fl n
Dry run, do not actually delete anything.
.It Fl p Ar tree
Specifies which ports
.Ar tree
to use.
This can be specified multiple times to consider multiple tress.
.It Fl y
Assume yes, do not confirm and just delete the files.
.It Fl v
This will show more information during the build.
Specify twice to enable debug output.
.El
.Ss pkgclean
This command is used to delete all packages not specified to build.
.Pp
These subcommands are mutually exclusive.
.Bl -tag -width "-f conffile"
.It Fl A
Remove all packages.
.It Fl a
Keep all known ports in the tree.
.It Fl f Ar file
Absolute path to a file which contains the list of ports to keep.
Ports must be specified in the form
.Ar category/port
and shell-style comments are allowed.
Multiple
.Fl f Ar file
arguments may be specified at once.
.It cat/port cat/port2 ...
A list of ports can be specified directly.
.El
.Pp
Here are the options associated with the
.Cm pkgclean
command.
This command accepts the following options:
.Bl -tag -width "-f conffile"
.It Fl j Ar name
Jail to use for the packages to inspect.
.It Fl J Ar number
This argument specifies how many
.Ar number
jobs will run in parallel for gathering package information.
.It Fl n
Dry run, do not actually delete anything.
.It Fl N
Do not build package repository or INDEX when done cleaning.
.It Fl p Ar tree
Specifies which ports
.Ar tree
to use.
.It Fl R
Also clean restricted packages.
.It Fl y
Assume yes, do not confirm and just delete the files.
.It Fl v
This will show more information during the build.
Specify twice to enable debug output.
.It Fl z Ar set
SET to use for the packages to inspect.
.El
.Ss options
This command accepts the following parameters:
.Bl -tag -width "-f conffile"
.It Fl f Ar file
Absolute path to a file which contains the list of ports to configure.
Ports must be specified in the form
.Ar category/port
and shell-style comments are allowed.
.It cat/port cat/port2 ...
A list of ports can be specified directly.
.El
.Pp
This command accepts the following options:
.Bl -tag -width "-f conffile"
.It Fl a Ar architecture
Specifies which
.Ar architecture
of FreeBSD to use to show options.
(Default: the one of jail
.Ar jailname
)
.It Fl c
Use 'config' target, which will always show the dialog for the given ports.
.It Fl C
Use 'config-conditional' target, which will only bring up the dialog on new options for the given ports.
(This is the default)
.It Fl j Ar jailname
If given, configure the options only for the given jail.
.It Fl p Ar portstree
Run the configuration inside the given ports tree (by default uses default)
.It Fl n
Do not be recursive
.It Fl r
Remove port options instead of configuring them
.It Fl s
Show port options instead of configuring them
.It Fl z Ar set
This specifies which SET to use for the build.
See
.Sx CUSTOMISATION
for examples of how this is used.
.El
.Pp
The
.Cm options
subcommand can also take the list of ports to configure through command line
arguments instead of the using a file list.
.Ss queue
This command takes a
.Nm
command in argument.
.Pp
There are no options associated with the
.Cm queue
command.
.Ss status
.Nm status
sorts by SETNAME, PORTSTREE, JAILNAME and then BUILDNAME.
.Pp
This command accepts the following options:
.Bl -tag -width "-f conffile"
.It Fl a
Show all builds, not just latest.
This implies
.Fl f .
.It Fl b
Show details about what each builder for the matched builds are doing.
.It Fl B Ar name
Specifies which buildname to match on.
This supports shell globbing.
Defaults to "latest".
Specifying this implies the
.Fl f
flag.
.It Fl c
Show a more compact output and do not include some columns.
.It Fl f
Show finished builds, not just currently running.
This is implied by the
.Fl a ,
.Fl B
and
.Fl r
flags.
.It Fl H
Do not print headers and separate fields by a single tab instead of arbitrary
white space.
.It Fl j Ar name
Specifies the
.Ar name
of the jail to filter by.
.It Fl l
Show logs instead of URL.
.It Fl p Ar tree
This flag specifies which ports
.Ar tree
to filter builds by.
.It Fl r
Show build results.
This implies the
.Fl f
flag.
.It Fl z Ar set
This specifies which SET to filter builds by.
Use
.Sy 0
to match on empty SET.
.El
.Sh ENVIRONMENT
The
.Nm
command may use the following environment variable:
.Bl -tag -width "HTTP_PROXY FTP_PROXY"
.It Sy FETCH_BIND_ADDRESS
The bind address used by
.Xr fetch 1
for
.Nm jail .
See
.Xr fetch 3
for more details.
.It Sy HTTP_PROXY FTP_PROXY
The proxy configuration for
.Nm ports
and
.Nm jail .
See
.Xr fetch 3
for other supported proxy environment variables.
.It Sy MAKEOBJDIRPREFIX
Passes through for
.Nm jail
builds.
.It Sy POUDRIERE_ETC
If specified, the path to poudriere's config directory.
Defaults to
.Pa /usr/local/etc .
.It Sy UMASK
The umask for files created by
.Nm .
Defaults to
.Sy 022.
.El
.Sh FILES
.Bl -tag -width ".Pa POUDRIERE_ETC/poudriere.d/poudriere.conf" -compact
.It Pa POUDRIERE_ETC/poudriere.conf
See self-documented
.Pa /usr/local/etc/poudriere.conf.sample
for example.
.It Pa POUDRIERE_ETC/poudriere.d/poudriere.conf
The configuration can be stored in the poudriere.d directory as well.
.It Pa POUDRIERE_ETC/poudriere.d
This directory contains various configuration files for the different jails.
.El
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
.Ss Bulk build of specific binary packages
This first example provides a guide on how to use
.Nm
for bulk build packages.
.Pp
.Bq Prepare infrastructure
.Pp
First you have to create a jail, which will hold all the building
infrastructure needs.
.Pp
.Dl "poudriere jail -c -v 8.2-RELEASE -a amd64 -j 82amd64"
.Pp
A jail will take approximately 3GB of space.
.Pp
Of course you can use another version of
.Fx ,
regardless of what version you are running.
amd64 users can choose i386 arch like in this
example:
.Pp
.Dl "poudriere jail -c -v 8.1-RELEASE -a i386 -j 81i386"
.Pp
This command will fetch and install a minimal jail, small (~400MB) so
you can create a lot of them.
It will install the jail under the pool
you have chosen, at poudriere/jailname.
.Pp
You also need to have at least one ports tree to build packages from,
so let us take the default configuration and create a ports tree.
.Pp
.Dl "poudriere ports -c"
.Pp
A ports tree will take approximately 4GB of space.
.Pp
.Bq Specify a list of ports you want to build
.Pp
Create a flat text file in which you put the ports you want to see
built by
.Nm :
.Pp
.Dl "echo 'sysutils/screen' > ~/pkglist"
.Dl "echo 'editors/vim' >> ~/pkglist"
.Pp
Any line starting with the hash sign will be treated as a comment.
.Pp
.Bq Launch the bulk build
.Pp
Now you can launch the bulk build.
At minimum the jail and list of packages to build must be specified.
.Pp
.Dl "poudriere bulk -f ~/pkglist -j 81i386"
.Pp
.Bq Find your packages
.Pp
Once the bulk build is over, you can meet your shiny new packages here:
.Pp
.Dl Pa /usr/local/poudriere/data/packages/81i386
.Pp
with 81i386 as the name of the jail.
.Ss Test a single port
This second example show how to use
.Nm
for a single port.
.Pp
Let's take the example of building a single port;
.Pp
.Dl "poudriere testport -o category/port -j myjail"
.Pp
all the tests will be done in myjail.
.Pp
It starts the jail, then mount the ports tree (nullfs), then mounts the
package dir (pourdriere/data/packages/<jailname>-<tree>-<setname>), then it mounts the
~/ports-cvs/mybeautifulporttotest (nullfs) it builds all the dependencies
(except runtime ones) and log it to
poudriere/data/logs/testport/jailname/default/mybeautifulporttotest.log).
.Pp
If packages for the dependencies already exist, then
.Nm
will use them.
.Pp
When all the dependencies are built, packages for them are created so
that next time it will be faster.
.Pp
All the dependency phase is done with PREFIX == LOCALBASE.
.Pp
After that it will build the port itself with LOCALBASE != PREFIX
and log the build to
poudriere/data/logs/testport/jailname/default/mybeautifulporttotest.log
.Pp
Poudriere will try to:
install it,
create a package from it,
deinstall it,
check for cruft left behind and
propose the line to add to pkg-plist if needed.
.Pp
Poudriere is very easy to extend so that additional tests can be easily added.
.Sh FLAVORS
.Cm bulk -a
will build all FLAVORS for each port.
Otherwise
.Cm bulk
and
.Cm testport
use the following rules:
.Bl -bullet -compact
.It
A FLAVOR of
.Sy bar
for port
.Pa devel/foo
is specified as
.Sy devel/foo@bar .
.El
.Pp
If
.Va FLAVOR_DEFAULT_ALL
is not set, or is set to
.Sy no
(the default), in
.Pa poudriere.conf,
then:
.Bl -bullet -compact
.It
All FLAVORS for a port, without a specified FLAVOR, will be built
using the FLAVOR
.Sy all :
.Sy devel/foo@all .
.It
The first (default) FLAVOR for a port is built by not specifying a FLAVOR:
.Sy devel/foo .
.El
.Pp
If
.Va FLAVOR_DEFAULT_ALL
is set to
.Sy yes
in
.Pa poudriere.conf,
then:
.Bl -bullet -compact
.It
All FLAVORS for a port, without a specified FLAVOR, will be built:
.Sy devel/foo .
.It
The first (default) FLAVOR for a port is built by specifying the FLAVOR
.Sy - :
.Sy devel/foo@-
.El
.Pp
.Ss KNOWN ISSUES
.Bl -bullet -compat
.It
An invalid FLAVOR for a port will cause an error during dependency calculation.
.It
MOVED entries do not support a source FLAVOR, only a target one.
.El
.Sh CUSTOMISATION
For bulk building, you can customize binary packages produced by
.Nm
by changing build options port by port, and you can also specify
building directives in a make.conf file.
.Ss Custom build options
Before building a package,
.Nm
can mount a directory containing option files if available.
.Nm
will check for any of these directories in this order:
.Pp
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<tree>-<setname>-options
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<setname>-options
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<tree>-options
.Dl Pa /usr/local/etc/poudriere.d/<tree>-<setname>-options
.Dl Pa /usr/local/etc/poudriere.d/<setname>-options
.Dl Pa /usr/local/etc/poudriere.d/<tree>-options
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-options
.Dl Pa /usr/local/etc/poudriere.d/options
.Pp
If a directory with this name exists, it is null-mounted into the
.Pa /var/db/ports/
directory of the jail, thus allowing to build package
with custom OPTIONS.
.Pp
The
.Cm options
subcommand can be used to easily configure options in the correct directory.
.Pp
This directory has the usual layout for options: it contains one directory per
port (the name of the port) containing an 'options' file with lines similar to:
.Pp
.Dl WITH_FOO=true
.Dl WITHOUT_BAR=true
.Pp
As a starter, you may want to copy an existing
.Pa /var/db/ports/
to
.Pa /usr/local/etc/poudriere.d/options .
.Ss Blacklist ports
You can also specify a blacklist which will disallow the lists port origins
from building on the matched jail.
Any of the following are allowed and will all be used in the order shown:
.Pp
.Dl Pa /usr/local/etc/poudriere.d/blacklist
.Dl Pa /usr/local/etc/poudriere.d/<setname>-blacklist
.Dl Pa /usr/local/etc/poudriere.d/<tree>-blacklist
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-blacklist
.Dl Pa /usr/local/etc/poudriere.d/<tree>-<setname>-blacklist
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<tree>-blacklist
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<setname>-blacklist
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<tree>-<setname>-blacklist
.Pp
If QEMU is being used then a special qemu blacklist is also loaded.
.Dl Pa /usr/local/etc/poudriere.d/qemu-blacklist
.Ss Create optional poudriere.conf
You can also specify an optional poudriere.conf that is pulled in
depending on the build.
Any of the following are allowed and will all be used in the order shown:
.Pp
.Dl Pa /usr/local/etc/poudriere.d/poudriere.conf
.Dl Pa /usr/local/etc/poudriere.d/<setname>-poudriere.conf
.Dl Pa /usr/local/etc/poudriere.d/<tree>-poudriere.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-poudriere.conf
.Dl Pa /usr/local/etc/poudriere.d/<tree>-<setname>-poudriere.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<tree>-poudriere.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<setname>-poudriere.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<tree>-<setname>-poudriere.conf
.Ss Create optional make.conf
You can also specify a global make.conf which will be used for all the
jails.
Any of the following are allowed and will all be used in the order shown:
.Pp
.Dl Pa /usr/local/etc/poudriere.d/make.conf
.Dl Pa /usr/local/etc/poudriere.d/<setname>-make.conf
.Dl Pa /usr/local/etc/poudriere.d/<tree>-make.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-make.conf
.Dl Pa /usr/local/etc/poudriere.d/<tree>-<setname>-make.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<tree>-make.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<setname>-make.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-<tree>-<setname>-make.conf
The
.Pa /usr/local/etc/poudriere.d/hooks/plugins/<plugin>/
directory may contain any of the above patterns as well.
.Ss Create optional src.conf
You can also specify a global src.conf which will be used for building
jails with the
.Cm jail -c
subcommand.
Any of the following are allowed and will all be used in the order shown:
.Pp
.Dl Pa /usr/local/etc/poudriere.d/src.conf
.Dl Pa /usr/local/etc/poudriere.d/<setname>-src.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-src.conf
.Ss Create optional src-env.conf
You can also specify a global src-env.conf which will be used for building
jails with the
.Cm jail -c
subcommand.
Any of the following are allowed and will all be used in the order shown:
.Pp
.Dl Pa /usr/local/etc/poudriere.d/src-env.conf
.Dl Pa /usr/local/etc/poudriere.d/<setname>-src-env.conf
.Dl Pa /usr/local/etc/poudriere.d/<jailname>-src-env.conf
.Ss Hooks
Hook scripts may be loaded in any of the following paths:
.Pp
.Dl Pa /usr/local/etc/poudriere.d/hooks/<hook>.sh
.Dl Pa /usr/local/etc/poudriere.d/hooks/plugins/<plugin>/<hook>.sh
.Pp
For specific hook documentation see:
.Lk https://github.com/freebsd/poudriere/wiki/hooks
.Sh CAVEATS
.Ss Jailname
.Fl j ,
.Fl z
and
.Fl p
are all used in the name of the jail.
.Pp
Be careful to respect the names supported by jail(8):
.Bd -literal
    "This is an arbitrary string that identifies a jail (except it
     may not contain a '.')"
.Ed
.Pp
Be also careful to not begin the name of the jail by a number if you are
not running FreeBSD 9.0 or later:
.Pp
.Lk http://svn.freebsd.org/viewvc/base?view=revision&revision=209820
.Sh BUGS
In case of bugs, feel free to file a report:
.Pp
.Lk https://github.com/freebsd/poudriere/issues
.Sh AUTHORS
.An Baptiste Daroussin Aq bapt@FreeBSD.org
.An Bryan Drewery Aq bdrewery@FreeBSD.org
